### Use markdown formatting for the following questions (e.g., bold lettering, bullet points, different font sizes, etc.):

1. What does Pandas stand for?

Pandas is an open-source Python package that is widely used

2. What are the 2 collections used in Pandas?
   * Panel Data
   * Python Data Analysis

3.  Name 4 things Pandas can do for us.
   * load
   * prepare
   * manipulate
   * analyselyze

4. To permanently sort a DataFrame, which keyword should one use with the df.sort() method?
   
   Inplace is true

5. What is a CSV?

   comma separated values

6. When cleaning data what values do we not like in our data?
  * Duplicate values
  * Null values

### Please Complete this Coding Exercise:

7. Import NumPy, use one of the NumPy methods and create an array with a shape of (2, 3, 2). You can use the reshape method -- .reshape()

In [84]:
import numpy as np
import pandas as pd
my_firstArray= np.arange(12).reshape(2, 3, 2)
my_firstArray

array([[[ 0,  1],
        [ 2,  3],
        [ 4,  5]],

       [[ 6,  7],
        [ 8,  9],
        [10, 11]]])

8. Use NumPy .linspace() to create an array with 6 linearly spaced values between 0 and 20

9. Make a Deep Copy of the above array

10. Concatenate these 3 arrays into a new array named 'newArray'...

In [14]:
array1= ([[25, 16]])
array2= ([[11, 2], [13, 4]])
array3= ([[7, 81], [5, 6], [11, 12]])
newArray = np.concatenate((array1, array2, array3), axis=0)
print(newArray)

[[25 16]
 [11  2]
 [13  4]
 [ 7 81]
 [ 5  6]
 [11 12]]

11. Sort 'newArray' in order into 'sortedArray'

In [16]:
print(np.sort(newArray))

[[16 25]
 [ 2 11]
 [ 4 13]
 [ 7 81]
 [ 5  6]
 [11 12]]

12. Unpack the array tuples from the above 'reshapedArray' into 4 well named variables. Print the 4 variables.

In [20]:
m,n,p,q,r,s = newArray
print("m = ", m)
print("n = ", n)
print("p = ", p)
print("q = ", q)
print("r = ", r)
print("s = ", s)

m =  [25 16]
n =  [11  2]
p =  [13  4]
q =  [ 7 81]
r =  [5 6]
s =  [11 12]


13. Combined and sort the following arrays into one called 'comboArray' ...

In [23]:
one = np.array([10, 11, 12, 13, 14, 15, 16, 17])
two = np.array([20, 21, 22, 23, 24, 25, 26, 27])
three = np.array ([ 0, 1, 2, 3, 4, 5, 6, 7])
comboArray = np.concatenate((one, two,three),axis=0)
print('combined array is =', comboArray)
sorted_comboArray = np.sort(comboArray)
print('sorted comboArray in ascending order is=',sorted_comboArray)

combined array is = [10 11 12 13 14 15 16 17 20 21 22 23 24 25 26 27  0  1  2  3  4  5  6  7]
sorted comboArray in ascending order is= [ 0  1  2  3  4  5  6  7 10 11 12 13 14 15 16 17 20 21 22 23 24 25 26 27]

14. Take 'comboArray' and perform the following slicing activities:

In [28]:
# print sec1 - the 2nd element
second_element=sorted_comboArray[1]
print('2nd element is=',second_element)

2nd element is= 1

In [37]:
#print sec2 - all elements from the 3rd element to the last
element3_last=sorted_comboArray[2:]
print('all element from 3 to the last =',element3_last)

all element from 3 to the last = [ 2  3  4  5  6  7 10 11 12 13 14 15 16 17 20 21 22 23 24 25 26 27]

In [41]:
#print sec3 - all elements from the 4th to the 14th elements
element4_14=sorted_comboArray[3:15]
print('all element from 4 to the 14th =',element4_14)

all element from 4 to the 14th = [ 3  4  5  6  7 10 11 12 13 14 15 16]

In [40]:
#print sec4 - the last 6 elements
last_6=sorted_comboArray[18:]
print('the last 6 =',last_6)

the last 6 = [22 23 24 25 26 27]

In [43]:
#print sec5 - all element from #0 up to and including #15, using the negative number method, i.e. taking a section from the end.
zero_to_15 = sorted_comboArray[0:14]
print('all element from 0 to 15 inclusive =',zero_to_15)

all element from 0 to 15 inclusive = [ 0  1  2  3  4  5  6  7 10 11 12 13 14 15]

In [50]:
#print sec6 - from #20 every even element to the end
even_numbers = sorted_comboArray[-1]
print('even numbers from 20 =',even_numbers)

even numbers from 20 = 27

In [ ]:
#print sec7 - from the last element moving forward, every 5th element.

15. Using Series, create a DataFrame that looks like this:

In [78]:
my_DF = {
    "Ingredients": ["Flour", "Milk", "Eggs", "Spam"],
    "Quantity": [4,1,2,1],
    "Unit": ["cups", "cup", "large", "can"]
    }
my_DataFrame = pd.DataFrame(my_DF, columns=['Ingredients','Quantity', 'Unit'])
my_DataFrame

  Ingredients  Quantity   Unit
0       Flour         4   cups
1        Milk         1    cup
2        Eggs         2  large
3        Spam         1    can

In [79]:
my_DataFrame.set_index('Ingredients')

             Quantity   Unit
Ingredients
Flour               4   cups
Milk                1    cup
Eggs                2  large
Spam                1    can

16. Take this data and create a DataFrame named studentData

In [8]:
   my_list= {'Name': ['Jai', 'janusha', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc'],
        'Address': ['Delhi', 'Doha', 'Chennai', 'Dakhar'],
        'Age': [21, 23, 24, 21],
        'Pets': ['Dog', 'Bunny', 'Chinchilla', 'Parrot'],
        'Sport': ['Darts', 'Basketball', 'PaddleBoarding', 'Cricket']}
studentData = pd.DataFrame(my_list, columns=['Name', 'Height',
                                    'Qualification', 'Address','Age',
                                     'Pets', 'Sport'])
studentData

      Name  Height Qualification  Address  Age        Pets           Sport
0      Jai     5.1           Msc    Delhi   21         Dog           Darts
1  janusha     6.2            MA     Doha   23       Bunny      Basketball
2   Gaurav     5.1           Msc  Chennai   24  Chinchilla  PaddleBoarding
3     Anuj     5.2           Msc   Dakhar   21      Parrot         Cricket

17. Add a new column to the DataFrame with the following deserts: ["ice cream", "Cashew Fudge", "waffels", "Carrot Halwa"]

In [9]:
deserts= ["ice cream", "Cashew Fudge", "waffels", "Carrot Halwa"]
studentData['Deserts']=deserts
studentData

,Name,Height,Qualification,Address,Age,Pets,Sport,Deserts
0,Jai,5.1,Msc,Delhi,21,Dog,Darts,ice cream
1,janusha,6.2,MA,Doha,23,Bunny,Basketball,Cashew Fudge
2,Gaurav,5.1,Msc,Chennai,24,Chinchilla,PaddleBoarding,waffels
3,Anuj,5.2,Msc,Dakhar,21,Parrot,Cricket,Carrot Halwa

18. Sort the 'studentData' DataFrame in Ascending order -- Sorting by column 'Name' and then "address"

In [10]:
studentData.sort_values(by = ['Name','Address'], inplace = True)
studentData

,Name,Height,Qualification,Address,Age,Pets,Sport,Deserts
3,Anuj,5.2,Msc,Dakhar,21,Parrot,Cricket,Carrot Halwa
2,Gaurav,5.1,Msc,Chennai,24,Chinchilla,PaddleBoarding,waffels
0,Jai,5.1,Msc,Delhi,21,Dog,Darts,ice cream
1,janusha,6.2,MA,Doha,23,Bunny,Basketball,Cashew Fudge


19. Save this DataFrame here below to disc as a .CSV file with the name cows_and_goats.csv:

20. (A) Using Pandas, make your own .CSV file with data on vegetables and save it. (B) Using Pandas, make a change to your CSV file, and save a copy with a different name.